---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailVaryingRebarDimension
source: html/5573e989-a67a-24e2-11f7-d144dc735c22.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailVaryingRebarDimension Property

"Varying Rebar Set Dimensions"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailVaryingRebarDimension { get; }
```